src/InformationRegisters/Scan_ВерсииСпецификаций/Scan_ВерсииСпецификаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Scan_ВерсииСпецификаций</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Опции</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <attributes>
    <name>ПродуктКП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВерсииСпецификации</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерКПSPORT</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Спецификация</name>
    <type>
      <types>CatalogRef.Scan_ВерсииБазовыхСпецификаций</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидСпецификации</name>
    <type>
      <types>CatalogRef.Scan_ВидыСпецификацийПродуктов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Версия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Catalogs/Scan_ВерсииБазовыхСпецификаций/Scan_ВерсииБазовыхСпецификаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Scan_ВерсииБазовыхСпецификаций</name>
  <owners>Catalog.Scan_СпецификацииПродуктов</owners>
  <attributes>
    <name>IDExternalSystem</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияСпецификации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидСпецификации</name>
    <type>
      <types>CatalogRef.Scan_ВидыСпецификацийПродуктов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОбновления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Опции</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>РасшифровкаОпций</name>
    <attributes>
      <name>Опция</name>
      <type>
        <types>CatalogRef.Scan_ОпцииПродуктов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Использование</name>
    <attributes>
      <name>ОбъектИспользования</name>
      <type>
        <types>CatalogRef.Scan_СпециальныеУсловия</types>
        <types>CatalogRef.Scan_СоглашенияОПоставке</types>
      </type>
    </attributes>
    <attributes>
      <name>ВерсияСпецификации</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/InformationRegisters/Scan_ВерсииСпецификаций/ManagerModule.bsl
// Функция записи параметров в регистр сведений
Функция ЗаписьЗначенияРегистраСведения(СтруктураРеквизитов) Экспорт //rarus bonmak 20.03.2020 14177 ++
	Отказ = Ложь;
	Записывать = Ложь;	
	СтруктураОтбора = ПреобразоватьСтруктуруРеквизитов(СтруктураРеквизитов);
	
	Если СтруктураОтбора = Неопределено Тогда
		Отказ = Истина;
		Возврат Отказ;
	КонецЕсли;
	ТекДата = ТекущаяДата();
	НаборЗаписей = РегистрыСведений.Scan_ВерсииСпецификаций.СоздатьНаборЗаписей();	
	НаборЗаписей.Отбор.Спецификация.Установить(СтруктураОтбора.Спецификация);
	НаборЗаписей.Отбор.ВидСпецификации.Установить(СтруктураОтбора.ВидСпецификации);
	НаборЗаписей.Отбор.Версия.Установить(СтруктураОтбора.Версия);
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() = 1 Тогда
		//проверим отличия в опциях
		СтрокаНабора = НаборЗаписей[0]; 
		Если СтруктураОтбора.Опции <> СтрокаНабора.Опции Тогда  
			СтрокаНабора.Опции = СтруктураОтбора.Опции;
			СтрокаНабора.ДатаВерсииСпецификации = СтруктураОтбора.ДатаВерсииСпецификации;
			Записывать = Истина;			
		КонецЕсли;		
	ИначеЕсли НаборЗаписей.Количество() = 0 Тогда
		СтрокаНабора = НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаНабора, СтруктураОтбора);
		СтрокаНабора.Период = ТекДата;
		Записывать = Истина;		
	КонецЕсли;		
	Если Записывать Тогда
		Попытка
			НаборЗаписей.Записать();
		Исключение	
			Отказ = Истина;	
		КонецПопытки;
	КонецЕсли;	
	Возврат Отказ;
КонецФункции //rarus bonmak 20.03.2020 14177 --

Функция ПреобразоватьСтруктуруРеквизитов(СтруктураРеквизитов) //rarus bonmak 20.03.2020 14177 ++
	
	//rarus ozhnik 15888 14.07.2020 + 
	Если СтруктураРеквизитов.Свойство("Спецификация") Тогда
		НайденныйЭлемент = СтруктураРеквизитов.Спецификация;	
	Иначе //rarus ozhnik 15888 14.07.2020 -
		НайденныйЭлемент = Справочники.Scan_ВерсииБазовыхСпецификаций.НайтиПоРеквизиту("IDExternalSystem", СтруктураРеквизитов.IDExternalSystem);
		Если НайденныйЭлемент.Пустая() Тогда
			Возврат Неопределено;
		КонецЕсли;
		
	КонецЕсли; //rarus ozhnik 15888 14.07.2020 +-
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("Спецификация", НайденныйЭлемент);
	СтруктураОтбора.Вставить("ВидСпецификации",СтруктураРеквизитов.ВидСпецификации);
	СтруктураОтбора.Вставить("Версия",СтруктураРеквизитов.ВерсияСпецификации);
	СтруктураОтбора.Вставить("Опции",СтруктураРеквизитов.Опции);
	СтруктураОтбора.Вставить("ДатаВерсииСпецификации",СтруктураРеквизитов.ДатаВерсииСпецификации);
	СтруктураОтбора.Вставить("ПродуктКП", НайденныйЭлемент.Владелец.ПродуктКП);
	СтруктураОтбора.Вставить("НомерКПSPORT",НайденныйЭлемент.Владелец.НомерКПSPORT);
	
	Возврат СтруктураОтбора;
КонецФункции //rarus bonmak 20.03.2020 14177 --
